CreateContact.xml

<?xml version='1.0' encoding='UTF-8'?>
<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:ns1="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/applicationModule/types/"
    xmlns:ns2="http://xmlns.oracle.com/apps/cdm/foundation/parties/personService/"
    xmlns:ns3="http://xmlns.oracle.com/apps/cdm/foundation/parties/relationshipService/"
    xmlns:ns4="http://xmlns.oracle.com/apps/cdm/foundation/parties/contactPointService/">
    <ns0:Header />
    <ns0:Body>
        <ns1:createPerson>
            <ns1:personParty>
                <ns2:CreatedByModule>HZ_WS</ns2:CreatedByModule>
                <ns2:PersonProfile>
                    <ns2:PersonFirstName>{insert_data}</ns2:PersonFirstName>
                    <ns2:PersonLastName>{insert_data}</ns2:PersonLastName>
                    <ns2:CreatedByModule>HZ_WS</ns2:CreatedByModule>
                </ns2:PersonProfile>
                <ns2:Relationship>
                    <ns3:SubjectType>PERSON</ns3:SubjectType>
                    <ns3:SubjectTableName>HZ_PARTIES</ns3:SubjectTableName>
                    <ns3:ObjectId>{insert_data}</ns3:ObjectId>
                    <ns3:ObjectType>ORGANIZATION</ns3:ObjectType>
                    <ns3:ObjectTableName>HZ_PARTIES</ns3:ObjectTableName>
                    <ns3:RelationshipCode>CONTACT_OF</ns3:RelationshipCode>
                    <ns3:RelationshipType>CONTACT</ns3:RelationshipType>
                    <ns3:StartDate>{insert_data}</ns3:StartDate>
                    <ns3:CreatedByModule>HZ_WS</ns3:CreatedByModule>
                    <ns3:OrganizationContact>
                        <ns3:ContactNumber>ADE_TEST_CN</ns3:ContactNumber>
                        <ns3:CreatedByModule>HZ_WS</ns3:CreatedByModule>
                        <ns3:OrganizationContactRole>
                            <ns3:RoleType>CONTACT</ns3:RoleType>
                            <ns3:PrimaryFlag>{insert_data}</ns3:PrimaryFlag>
                            <ns3:CreatedByModule>HZ_WS</ns3:CreatedByModule>
                        </ns3:OrganizationContactRole>
                    </ns3:OrganizationContact>
                    <ns3:Email>
                        <ns4:OwnerTableName>HZ_PARTIES</ns4:OwnerTableName>
                        <ns4:PrimaryFlag>true</ns4:PrimaryFlag>
                        <ns4:CreatedByModule>HZ_WS</ns4:CreatedByModule>
                        <ns4:ContactPointPurpose>BUSINESS</ns4:ContactPointPurpose>
                        <ns4:StartDate>{insert_data}</ns4:StartDate>
                        <ns4:EmailAddress>{insert_data}</ns4:EmailAddress>
                    </ns3:Email>
                </ns2:Relationship>
            </ns1:personParty>
        </ns1:createPerson>
    </ns0:Body>
</ns0:Envelope>